phygeonet-master/case3/TemplateCase0.05/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
2500
(
-0.488498
-0.46856
-0.448621
-0.428682
-0.408743
-0.388805
-0.368866
-0.348927
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.498466
-0.495403
-0.492356
-0.489336
-0.486352
-0.483416
-0.480538
-0.477728
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.498466
0.495403
0.492356
0.489336
0.486352
0.483416
0.480538
0.477728
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.49
-0.47
-0.45
-0.43
-0.41
-0.39
-0.37
-0.35
...
)
;
    }
    down
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.49
-0.47
-0.45
-0.43
-0.41
-0.39
-0.37
-0.35
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
