phygeonet-master/case3/TemplateCase0.05/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
2500
(
-0.245119
-0.245119
-0.245119
-0.245119
-0.245119
-0.245119
-0.245119
-0.245119
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.245114
-0.23534
-0.225562
-0.215775
-0.205977
-0.196165
-0.186335
-0.176486
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.245114
-0.23534
-0.225562
-0.215775
-0.205977
-0.196165
-0.186335
-0.176486
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.25
0.25
0.25
0.25
0.25
0.25
0.25
0.25
...
)
;
    }
    down
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.25
-0.25
-0.25
-0.25
-0.25
-0.25
-0.25
-0.25
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
