phygeonet-master/case3/TemplateCase0.05/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
2500
(
0.005
0.005
0.005
0.005
0.005
0.005
0.005
0.005
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.005
0.005
0.005
0.005
0.005
0.005
0.005
0.005
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.005
0.005
0.005
0.005
0.005
0.005
0.005
0.005
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.005
0.005
0.005
0.005
0.005
0.005
0.005
0.005
...
)
;
    }
    down
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.005
0.005
0.005
0.005
0.005
0.005
0.005
0.005
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
